In [3]:
import numpy as np
import pandas as pd

In [4]:
dicr={
    "name":['ihta','ali','khan','muhammad'],
    "marks":[80,69,50,90],
    "city":['bannu','laki','karak','latamber']
}

In [6]:
pd.DataFrame(dicr)

       name  marks      city
0      ihta     80     bannu
1       ali     69      laki
2      khan     50     karak
3  muhammad     90  latamber

In [ ]:
pd.DataFrame(dicr,index=fails)